StatTracker/app/controllers/batting_stats_controller.rb

SELECT 'hits', 'at_bats', 'player_id', 'team_id' FROM "batting_stats"
---
	def single_season
		@batting_stats = BattingStat.single_season_sort(params[:stat])
		@table = GoogleVisualr::Table.new
		@table.add_column('string' , 'Name')
		@table.add_column('string' , 'Bats')
		@table.add_column('string' , 'Team')
		@table.add_column('string' , 'Year')
		@table.add_column('string' , params[:stat].titleize)
		@table.add_rows(50)
		@batting_stats.each { |b|

SELECT "players".* FROM "players" WHERE ("players"."id" = 12352) LIMIT 1
SELECT "batting_stats".* FROM "batting_stats" WHERE (player_id = 12352)
---
	def career_compare
		@batters = BattingStat.career_compare(params[:comp])
		@player = []
		@players = []
		@batters.each_value {|value|
			if @player.include?(value)
			else @player.push(value)
			end
		}
		@max = []
		@player.each {|p|
			@players.push(Player.find(p.to_i))
			@max.push(BattingStat.find(:all, :select => [:team_id], :conditions => ['player_id =?', p]).size)

SELECT "batting_stats".* FROM "batting_stats" INNER JOIN "teams" ON "teams"."id" = "batting_stats"."team_id" WHERE (player_id = 1 AND year = '2007')
SELECT "batting_post_stats".* FROM "batting_post_stats" WHERE (games >= 10 AND home_runs >= 3) ORDER BY games DESC, home_runs DESC
SELECT COUNT(*) FROM "batting_stats" WHERE (games >= 150 AND home_runs >= 30)
SELECT player_id, home_runs FROM "batting_stats" INNER JOIN "players" ON "players"."id" = "batting_stats"."player_id"
---
  def find_seasons
    number = params[:fields][:count].to_i
    @stats = []
    operations = []
    (1..number).each do |i|
      stat = params["#{i}"][:stat]
      next if stat.blank?
      operator = params["#{i}"][:operator]
      number = params["#{i}"][:number]
      string = stat.downcase.gsub(" ", "_") + " " + operator + " " + number
      @stats.push(stat)
      operations.push(string)

    end
    if params[:postseason].nil?
      @batting_stats = BattingStat.where(operations.join(" AND "))
    else
      @batting_stats = BattingPostStat.where(operations.join(" AND "))
    end
    @chart2 = GoogleVisualr::Table.new
		@chart2.add_column('string' , 'Name')
    @chart2.add_column('string' , 'Bats')
		@chart2.add_column('string' , 'Team')
    @chart2.add_column('string' , 'Year')
    @stats.each do |i|
     @chart2.add_column('number' , i.titleize)
    end
    @chart2.add_rows(@batting_stats.size)