StatTracker/app/controllers/fielding_stats_controller.rb

SELECT "fielding_stats".* FROM "fielding_stats" WHERE (position = 'SS' AND team.division = 12)
---
	def single_season
		@fielding_stats = FieldingStat.single_season_sort(params[:stat])
		@table = GoogleVisualr::Table.new
		@table.add_column('string' , 'Name')
		@table.add_column('string' , 'Throws')
		@table.add_column('string' , 'Team')
		@table.add_column('string' , 'Year')
		@table.add_column('string' , params[:stat].titleize)
		@table.add_rows(50)
		@fielding_stats.each { |b|

SELECT "fielding_stats".* FROM "fielding_stats" WHERE (games >= 120 AND errors_made <= 10) ORDER BY games DESC, errors_made DESC
---
  def find_seasons
    number = params[:fields][:count].to_i
    @stats = []
    operations = []
    (1..number).each do |i|
      stat = params["#{i}"][:stat]
      next if stat.blank?
      operator = params["#{i}"][:operator]
      number = params["#{i}"][:number]
	  if number.to_i < 0
		flash[:notice] = 'At least one of your values was invalid. Please try again.'
		redirect_to :back
	  end
      string = stat.downcase.gsub(" ", "_") + " " + operator + " " + number
      @stats.push(stat)
      operations.push(string)

    end
    if params[:postseason].nil?
      @batting_stats = FieldingStat.where(operations.join(" AND "))