StatTracker/app/controllers/franchises_controller.rb

  def index
    @franchises = Franchise.all
---
SELECT "franchises".* FROM "franchises"

    def team_search
    @query = params[:query]
    @franchises = Franchise.search(@query)
---
SELECT "franchises".* FROM "franchises" WHERE (lower(name) LIKE '%nationals%') ORDER BY active DESC