StatTracker/app/controllers/home_controller.rb

SELECT "franchises".* FROM "franchises" WHERE (lower(name) LIKE '%nationals%') ORDER BY active DESC
SELECT "players".* FROM "players" WHERE (lower(first_name) LIKE '%wright%' OR lower(last_name) LIKE '%wright%' OR lower(first_name) || ' ' || lower(last_name) LIKE '%wright%') ORDER BY (final_game IS NOT NULL), last_name ASC, first_name ASC
SELECT "teams".* FROM "teams" WHERE ("teams".franchise_id = 102) ORDER BY teams.id DESC LIMIT 1
---
  def search
    @query = params[:query]
	puts @query.length
	if @query.length < 3
		flash[:notice] = 'Please be more specific with your search'
		redirect_to :back
	 end
    @players = Player.player_search(@query)
    @franchises = Franchise.team_search(@query)
    @total_hits = @players.size + @franchises.size