StatTracker/app/controllers/pitching_stats_controller.rb

SELECT player_id, wins FROM "pitching_stats" INNER JOIN "players" ON "players"."id" = "pitching_stats"."player_id"
---
	def career
		@pitching_stats = PitchingStat.career_sort(params[:stat])
		@table = GoogleVisualr::Table.new
		@table.add_column('string' , 'Name')
		@table.add_column('string' , 'Throws')
		if params[:stat] == 'era'
			@table.add_column('string' , params[:stat].upcase)
		else @table.add_column('string' , params[:stat].titleize)
		end
		@table.add_rows(50)
		i = 0
			if PitchingStat.accessible_attributes.include?(params[:stat])