StatTracker/app/controllers/players_controller.rb

  def show
    @player = Player.find(params[:id])
	@position = FieldingStat.where("player_id = ?", @player.id).sort_by{|s| s.games}.last.position
	if @player.final_game.nil?
    @google_image = GoogleImage.all(@player.name+" rotoworld headshot", 0).first
	else
	@google_image = GoogleImage.all(@player.name+" baseball player", 0).first
	end
    @batting_stats=BattingStat.find(:all, :conditions => ['player_id = ?', params[:id]])
---
SELECT "players".* FROM "players" WHERE ("players"."id" = 5271) LIMIT 1
SELECT "fielding_stats".* FROM "fielding_stats" WHERE ("fielding_stats".player_id = 5271) ORDER BY fielding_stats.id DESC LIMIT 1
SELECT "batting_stats".* FROM "batting_stats" WHERE (player_id = '5271')

		options.each_pair do | key, value |
			@chart.send "#{key}=", value
		end
   @batting_stats_post=BattingPostStat.find(:all, :conditions => ['player_id = ?', params[:id]])
---
SELECT "batting_post_stats".* FROM "batting_post_stats" WHERE (player_id = '5271')
SELECT "pitching_post_stats".* FROM "pitching_post_stats" WHERE (player_id = '5271')

  options.each_pair do | key, value |
    @chart2.send "#{key}=", value
  end
@pitching_stats=PitchingStat.find(:all, :conditions => ['player_id = ?', params[:id]])
---
SELECT "pitching_stats".* FROM "pitching_stats" WHERE (player_id = '5271')

  def player_search
    @query = params[:query]
	# first_name, last_name, year, dash = @query.split(" ")
	# last_name.chomp!(",")
	# name = first_name + " " + last_name
    @players = @query.blank?? Array.new : Player.player_search(@query)
---
SELECT "players".* FROM "players" INNER JOIN "fielding_stats" ON "fielding_stats"."player_id" = "players"."id" WHERE ((lower(first_name) like '%jeter%' OR lower(last_name) like '%jeter%' OR lower(name) like '%jeter%') AND lower(last_name) like '%' AND position like '%') ORDER BY (final_game IS NOT NULL), final_game DESC, last_name ASC, first_name ASC