StatTracker/app/controllers/players_controller.rb

  def show
    @player = Player.find(params[:id])
	if @player.final_game.nil?
    @google_image = GoogleImage.all(@player.name+" rotoworld headshot", 0).first
	else
	@google_image = GoogleImage.all(@player.name+" baseball player", 0).first
	end
    @batting_stats=BattingStat.find(:all, :conditions => ['player_id = ?', params[:id]])
    @chart = GoogleVisualr::Table.new
		@chart.add_column('string' , 'Year')
		@chart.add_column('string' , 'Age')
		@chart.add_column('string' , 'Team')
		@chart.add_column('string' , 'G')
		@chart.add_column('string' , 'PA')
    @chart.add_column('string' , 'AB')
    @chart.add_column('string' , 'R')
    @chart.add_column('string' , 'H')
    @chart.add_column('string' , '2B')
    @chart.add_column('string' , '3B')
    @chart.add_column('string' , 'HR')
    @chart.add_column('string' , 'RBI')
    @chart.add_column('string' , 'SB')
    @chart.add_column('string' , 'CS')
    @chart.add_column('string' , 'BB')
    @chart.add_column('string' , 'K')
    @chart.add_column('string' , 'BA')
    @chart.add_column('string' , 'SLG')
    @chart.add_column('string' , 'TB')
    @chart.add_column('string' , 'OBP')
    @chart.add_column('string' , 'OPS')
    @chart.add_rows(@batting_stats.size+1)
---
SELECT "teams".* FROM "teams" WHERE ("teams"."id" = 2325) LIMIT 1