StatTracker/app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams" WHERE ("teams"."id" = 13) LIMIT 1
SELECT "franchises".* FROM "franchises" WHERE ("franchises"."id" = 80) LIMIT 1
---
  def show
    @team = Team.find(params[:id])
    @franchise =Franchise.find(@team.franchise_id)

SELECT "batting_stats".* FROM "batting_stats" WHERE ("batting_stats".team_id = 13)
SELECT "fielding_stats".* FROM "fielding_stats" WHERE ("fielding_stats".player_id = 517) AND (team_id = 13)
SELECT "pitching_stats".* FROM "pitching_stats" WHERE ("pitching_stats".team_id = 13)
SELECT "players".* FROM "players" WHERE ("players"."id" = 517) LIMIT 1
---
      @chart3.send "#{key}=", value
		end

    @roster = @team.batting_stats.map{|s| s.player} + @team.pitching_stats.map{|s| s.player} + @team.fielding_stats.map{|s| s.player}